import {importDoc} from '@utils/formatters';
import type {IDocumentsList, IDocumentsListGroup} from '@utils/types';

export const auditReports: IDocumentsListGroup[] = [
	{
		groupTitle: '2022', list: [
			{
				title: 'Звіт незалежного аудитора щодо фінансової звітності за 2022 рік ',
				link: importDoc('zvit-audit_2022.pdf'),
			},
			{
				title:
					'Незалежний звіт з надання впевненості щодо річних звітних даних за 2022 рік ',
				link: importDoc('zvit-vpevn_2022.pdf'),
			},
		]
	}, {
		groupTitle: '2021', list: [
			{
				title: 'Аудиторський звіт щодо звітності за 2021р. ',
				link: importDoc('audit vp p3.pdf'),
			},
			{
				title: 'Аудиторський звіт щодо звітності за 2021р. ',
				link: importDoc('audit vp p2.pdf'),
			},
			{
				title: 'Аудиторський звіт щодо звітності за 2021р',
				link: importDoc('audit vp p1.pdf'),
			},
			{
				title: 'Аудиторський звіт щодо звітності за 2021р',
				link: importDoc('audit p2.pdf'),
			},
			{
				title: 'Аудиторський звіт щодо звітності за 2021р.',
				link: importDoc('audit p1.pdf'),
			},
		]
	}, {
		groupTitle: '2020', list: [
			{
				title: 'Аудиторський висновок та звітність за 2020р. (ч.2)',
				link: importDoc('audit finrang2020_38-end.pdf'),
			},
			{
				title: 'Аудиторський висновок та звітність за 2020р. (ч.1)',
				link: importDoc('audit finrang2020_1-37.pdf'),
			}
		]
	}
];
export const companyShareInfo: IDocumentsList[] = [
	{
		title: 'Ліцензії на надання фінансових послуг ',
		link: importDoc('ТОВ_ФК_Фін-Ранг_витяг.pdf'),
	},
	{
		title: 'Свідоцтво ТОВ «ФК ФІН-РАНГ» ',
		link: importDoc('7. Svidotstvo TOV FK FIN-RANG.pdf'),
	},
	{
		title: 'Публічна інформація про ТОВ «ФК ФІН-РАНГ»',
		link: importDoc('Publichna informatsiia.pdf'),
	},
	{
		title:
			'Схематичне зображення структури власності ТОВ «ФК «ФІН-РАНГ» станом на 01.01.2024',
		link: importDoc('1_Struktura_vlasnosti_TOV_FK_FIN_RANH_010124.pdf'),
	},
	{
		title:
			'Схематичне зображення структури власності ТОВ «ФК «ФІН-РАНГ» станом на 28.10.2022',
		link: importDoc('1_Struktura vlasnosti TOV FK FIN-RANH na 28.10.2022.pdf'),
	},
	{
		title:
			'Відомості про остаточних ключових учасників у структурі власності надавача фінансових послуг ТОВ «ФК «ФІН-РАНГ» станом на 28.10.2022 ',
		link: importDoc(
			'2_Vidomosti_pro_ostatochnykh_kliuchovykh_uchasnykiv_TOV_FK_FIN_RANH.pdf',
		),
	},
	{
		title:
			'Відомості про власників істотної участі в надавачі фінансових послуг ТОВ «ФК «ФІН-РАНГ» станом на 28.10.2022 ',
		link: importDoc(
			'3_Vidomosti_pro_vlasnykiv_istotnoi_uchasti_TOV_FK_FIN_RANH_na_28.pdf',
		),
	},
	{
		title:
			'Схематичне зображення структури власності ТОВ «ФК «ФІН-РАНГ» станом на 01.01.2023',
		link: importDoc('1_Struktura vlasnosti TOV FK FIN-RANH na 01.01.2023.pdf'),
	},
	{
		title:
			'Відомості про власників істотної участі в надавачі фінансових послуг ТОВ «ФК «ФІН-РАНГ» станом на 01.01.2024',
		link: importDoc(
			'3_Vidomosti_pro_vlasnykiv_istotnoi_uchasti_TOV_FK_FIN_RANH_010124.pdf',
		),
	},
	{
		title:
			'Відомості про остаточних ключових учасників у структурі власності надавача фінансових послуг ТОВ «ФК «ФІН-РАНГ» станом на 01.01.2023 ',
		link: importDoc(
			'2_Vidomosti_pro_ostatochnykh_kliuchovykh_uchasnykiv_TOV_FK_FIN_RANH (1).pdf',
		),
	},
	{
		title:
			'Відомості про остаточних ключових учасників у структурі власності надавача фінансових послуг ТОВ «ФК «ФІН-РАНГ» станом на 01.01.2024 ',
		link: importDoc(
			'2_Vidomosti_pro_ostatochnykh_kliuchovykh_uchasnykiv_TOV_FK_FIN_RANH_010124.pdf',
		),
	},
	{
		title:
			'Відомості про власників істотної участі в надавачі фінансових послуг ТОВ «ФК «ФІН-РАНГ» станом на 01.01.2023',
		link: importDoc(
			'3_Vidomosti_pro_vlasnykiv_istotnoi_uchasti_TOV_FK_FIN_RANH_na_01.pdf',
		),
	},
	{
		title: 'Ціни та тарифи на надання фін.послуг ТОВ «ФК «ФІН-РАНГ» ',
		link: importDoc('Tsiny ta taryfy.pdf'),
	},
	{
		title:
			'Інформація щодо ТОВ «ФК ФІН-РАНГ», умов та порядку діяльності, включно щодо фінансових послуг, які надаються ТОВ «ФК ФІН-РАНГ» клієнту ',
		link: importDoc('Informatsiia shchodo umov ta poriadku diialnosti.pdf'),
	},
	{
		title: 'Інформація про органи захисту прав споживачів',
		link: importDoc('Rekvizyty orhaniv z pytan zakhystu.pdf'),
	},
	{
		title: 'Механізми захисту прав споживачів ',
		link: importDoc('Mekhanizmy zakhystu prav spozhyvachiv.pdf'),
	},
	{
		title: 'Відомості про колекторські компанії',
		link: importDoc('5. Vidomosti pro kolektorski kompanii.pdf'),
	},
	{
		title:
			'Перелік контактних даних щодо діяльності залученої колекторської компанії',
		link: importDoc(
			'8. Perelik kontaktnykh danykh schodo diyalnosty zaluchenoyi kolektorskoyi kompanii.pdf',
		),
	},
	{
		title: 'Порядок обробки і захисту персональних даних у ТОВ «ФК «ФІН-РАНГ»',
		link: importDoc(
			'14. Poriadok obrobky i zakhystu personalnykh danykh  TOV FK FIN-RANG.pdf',
		),
	},
	{
		title: 'Інформація для маломобільних груп населення',
		link: importDoc('4. Informaciya dlya malomobilnih grup naselennya.pdf'),
	},
	{
		title:
			'Порядок розгляду ТОВ «ФК ФІН-РАНГ» звернень споживачів фінансових послуг ',
		link: importDoc(
			'3. Poriadok rozghliadu zvernen spozhyvachiv TOV FK FIN-RANG.pdf',
		),
	},
	{
		title: 'ПРАВИЛА НАДАННЯ ПОЗИКИ (ФІНАНСОВОГО КРЕДИТУ)',
		link: importDoc('Правила позики.doc'),
	}
]
export const reports: IDocumentsListGroup[] = [
	{
		groupTitle: '2024',
		list: [
			{
				title:
					'Схематичне зображення структури власності ТОВ «ФК «ФІН-РАНГ» станом на 01.01.2024',
				link: importDoc('42888239_e8479160b60d8a40ee7eb01530b33ad6.pdf'),
			},
			{
				title:
					'Відомості про остаточних ключових учасників у структурі власності надавача фінансових послуг ТОВ «ФК «ФІН-РАНГ» станом на 01.01.2024',
				link: importDoc('42888239_210cf87f4cce8092bfffe554f0d67388.pdf'),
			},
			{
				title:
					'Відомості про власників істотної участі в надавачі фінансових послуг ТОВ «ФК «ФІН-РАНГ» станом на 01.01.2024',
				link: importDoc('42888239_6e16fa7cef79b443f1aee41dccdfd86b.pdf'),
			},
			{
				title:
					'Примітки до фінансової звітності за період, що закінчився 31 березня 2024 року ',
				link: importDoc('ФІН-РАНГ.pdf'),
			},
			{
				title: ' Баланс (Звіт про фінансовий стан) на 31 березня 2024',
				link: importDoc('S0100115 Ф1. Баланс.pdf'),
			},
			{
				title:
					'Звіт про фінансові результати (Звіт про сукупний дохід) за I Квартал 2024',
				link: importDoc('S0100215 Ф2. Звіт про фінансові результати (в тисячах).pdf'),
			},
			{
				title: 'Звіт про рух грошових коштів (за прямим методом) за I Квартал 2024 ',
				link: importDoc(
					'S0100311 Ф3. Звiт про рух грошових коштiв (за прямим методом).pdf',
				),
			},
			{
				title: 'Звіт про власний капітал за I Квартал 2024',
				link: importDoc('S0104010 Ф4. Звіт про власний капітал.pdf'),
			}
		],
	},
	{
		groupTitle: '2023',
		list: [
			{
				title: 'Баланс (Звіт про фінансовий стан) на 31 грудня 2023',
				link: importDoc('S0100114 Ф1. Баланс (3).pdf'),
			},
			{
				title: 'Звіт про фінансові результати (Звіт про сукупний дохід) за Рік 2023 ',
				link: importDoc('S0100214 Ф2. Звіт про фінансові результати (в тисячах).pdf'),
			},
			{
				title: 'Звіт про рух грошових коштів (за прямим методом) за Рік 2023',
				link: importDoc(
					'S0100310 Ф3. Звiт про рух грошових коштiв (за прямим методом).pdf',
				),
			},
			{
				title: 'Звіт про власний капітал за Рік 2023',
				link: importDoc('S0104009 Ф4. Звіт про власний капітал.pdf'),
			},
			{
				title:
					'Примітки до фінансової звітності за період, що закінчився 31 грудня 2023 року',
				link: importDoc('Ф5 Примітки за 2023 рік.PDF'),
			},
			{
				title: 'Баланс (Звіт про фінансовий стан) на 30 вересня 2023',
				link: importDoc('S0100114 Ф1. Баланс.pdf'),
			},
			{
				title:
					'Звіт про фінансові результати (Звіт про сукупний дохід) за 9 Мiсяцiв 2023',
				link: importDoc(
					'S0100214 Ф2. Звіт про фінансові результати (в тисячах) (1).pdf',
				),
			},
			{
				title: 'Баланс (Звіт про фінансовий стан) на 31 березня 2023',
				link: importDoc('S0100114 Ф1. Баланс (1).pdf'),
			},
			{
				title: 'Звіт про власний капітал за 9 Мiсяцiв 2023',
				link: importDoc('S0104009 Ф4. Звіт про власний капітал (1).pdf'),
			},
			{
				title:
					'Примітки до фінансової звітності за період, що закінчився 30 вересня 2023',
				link: importDoc('Примітки ФК Фін-Ранг за 9 місяців 2023.doc'),
			},
			{
				title: 'Звіт про рух грошових коштів (за прямим методом) за 9 Мiсяцiв 2023',
				link: importDoc(
					'S0100310 Ф3. Звiт про рух грошових коштiв (за прямим методом) (1).pdf',
				),
			},
			{
				title:
					'Звіт про фінансові результати (Звіт про сукупний дохід) за I Квартал 2023',
				link: importDoc(
					'S0100214 Ф2. Звіт про фінансові результати (в тисячах) (2).pdf',
				),
			},
			{
				title: 'Звіт про рух грошових коштів (за прямим методом) за I Квартал 2023',
				link: importDoc(
					'S0100310 Ф3. Звiт про рух грошових коштiв (за прямим методом) (2).pdf',
				),
			},
			{
				title: 'Звіт про власний капітал за I Квартал 2023',
				link: importDoc('S0104009 Ф4. Звіт про власний капітал (2).pdf'),
			},
			{
				title:
					'Примітки до фінансової звітності за період, що закінчився 31 березня 2023 року ',
				link: importDoc('примітки фінранг за 1 квартал 2023.doc'),
			},
			{
				title: 'Баланс (Звіт про фінансовий стан) на 30 червня 2023',
				link: importDoc('S0100114 Ф1. Баланс (2).pdf'),
			},
			{
				title:
					'Звіт про фінансові результати (Звіт про сукупний дохід) за I Півріччя 2023',
				link: importDoc(
					'S0100214 Ф2. Звіт про фінансові результати (в тисячах) (3).pdf',
				),
			},
			{
				title: 'Звіт про рух грошових коштів (за прямим методом) за I Півріччя 2023 ',
				link: importDoc(
					'S0100310 Ф3. Звiт про рух грошових коштiв (за прямим методом) (3).pdf',
				),
			},
			{
				title: 'Звіт про власний капітал за I Півріччя 2023',
				link: importDoc('S0104009 Ф4. Звіт про власний капітал (3).pdf'),
			},
			{
				title:
					'Примітки до фінансової звітності за період, що закінчився 30 червня 2023 року ',
				link: importDoc('примітки фінранг за 1 півріччя 2023.doc'),
			},
			{
				title:
					'Схематичне зображення структури власності ТОВ «ФК «ФІН-РАНГ» станом на 01.01.2023',
				link: importDoc('42888239_5b391a962842072cf30474c92f92a1da.pdf'),
			},
			{
				title:
					'Відомості про остаточних ключових учасників у структурі власності надавача фінансових послуг ТОВ «ФК «ФІН-РАНГ» станом на 01.01.2023',
				link: importDoc('42888239_e4045d06f136f28de2e68357437565d5.pdf'),
			},
			{
				title:
					'Відомості про власників істотної участі в надавачі фінансових послуг ТОВ «ФК «ФІН-РАНГ» станом на 01.01.2023',
				link: importDoc('42888239_93e55c9d2a615422b161e948ad67a77f.pdf'),
			},
		],
	},
	{
		groupTitle: '2022',
		list: [
			{
				title:
					'Примітки до проміжної фінансової звітності за період, що закінчився 31 грудня 2022 р',
				link: importDoc('Примітки ТОВ ФК Фін-Ранг 2022р..pdf'),
			},
			{
				title: 'Баланс (Звіт про фінансовий стан) станом на 31 грудня 2022 р. ',
				link: importDoc('S0100114 Ф1. Баланс (4).pdf'),
			},
			{
				title:
					'Звіт про фінансові результати (Звіт про сукупний дохід) за Рік 2022 р.',
				link: importDoc(
					'S0100214 Ф2. Звіт про фінансові результати (в тисячах) (4).pdf',
				),
			},
			{
				title: 'Звіт про рух грошових коштів (за прямим методом) за Рік 2022 р',
				link: importDoc(
					'S0100310 Ф3. Звiт про рух грошових коштiв (за прямим методом) (4).pdf',
				),
			},
			{
				title: 'Звіт про власний капітал за Рік 2022 р. ',
				link: importDoc('S0104009 Ф4. Звіт про власний капітал (4).pdf'),
			},
			{
				title:
					'Схематичне зображення структури власності ТОВ «ФК «ФІН-РАНГ» станом на 28.10.2022',
				link: importDoc('42888239_99dea925b397858456f211abcbd82927.pdf'),
			},
			{
				title:
					'Відомості про остаточних ключових учасників у структурі власності надавача фінансових послуг ТОВ «ФК «ФІН-РАНГ» станом на 28.10.2022',
				link: importDoc('42888239_98b6f033c4c72ce639b7448cd7483558.pdf'),
			},
			{
				title:
					'Відомості про власників істотної участі в надавачі фінансових послуг ТОВ «ФК «ФІН-РАНГ» станом на 28.10.2022',
				link: importDoc('42888239_3f0900718ce45a0a788977be572f31e7.pdf'),
			},
			{
				title: 'Механізми захисту прав споживачів',
				link: importDoc('42888239_0089cfb528770306a56d5e15cab52f41.pdf'),
			},
			{
				title:
					'Порядок розгляду ТОВ «ФК ФІН-РАНГ» звернень споживачів фінансових послуг',
				link: importDoc('42888239_9f5aaf69f9f83668ae0c738b56a50145.pdf'),
			},
			{
				title: 'Інформація про органи захисту прав споживачів',
				link: importDoc('42888239_feee928ffa35bcfc69df20d72cf59cdf.pdf'),
			},
			{
				title:
					'Інформація щодо ТОВ «ФК ФІН-РАНГ», умов та порядку діяльності, включно щодо фінансових послуг, які надаються ТОВ «ФК ФІН-РАНГ» клієнту',
				link: importDoc('42888239_feee928ffa35bcfc69df20d72cf59cdf (1).pdf'),
			},
			{
				title: 'Публічна інформація про ТОВ «ФК ФІН-РАНГ»',
				link: importDoc('42888239_7b7a580b975fa78cb9f7d191c206de2b.pdf'),
			},
			{
				title: 'Свідоцтво ТОВ «ФК ФІН-РАНГ»',
				link: importDoc('42888239_b0f790d9663cd6ad125d95f47496bb95.pdf'),
			},
			{
				title: 'Ліцензії на надання фінансових послуг',
				link: importDoc('42888239_d986c2a91ee79ec3d7ba130a6c02f55e.pdf'),
			},
			{
				title: 'Інформація для маломобільних груп населення',
				link: importDoc('42888239_2c19eed88ac38b142eb49dd19cb7ae4e.pdf'),
			},
			{
				title: 'Ціни та тарифи на надання фін.послуг ТОВ «ФК «ФІН-РАНГ»',
				link: importDoc('42888239_83542a256080343c9f4c5fef16ba0829.pdf'),
			},
			{
				title: 'Відомості про колекторські компанії',
				link: importDoc('42888239_60f05bb2b95430fc5502a3cce7aeaad7.pdf'),
			},
			{
				title: 'Вимоги до етичної поведінки в ТОВ «ФК «ФІН-РАНГ»',
				link: importDoc('42888239_ced30fa6e00cb550eac6f694c01559cc.pdf'),
			},
			{
				title:
					'Перелік контактних даних щодо діяльності залученої колекторської компанії',
				link: importDoc('42888239_1713a277ee5d0127c1ea4b4ad6d16199.pdf'),
			},
			{
				title:
					'Порядок і спосіб погашення простроченої заборгованості в ТОВ «ФК «ФІН-РАНГ»',
				link: importDoc('42888239_f55545ba17f39b61d7fb9f8a20c9249e.pdf'),
			},
			{
				title: 'Порядок обробки і захисту персональних даних у ТОВ «ФК «ФІН-РАНГ»',
				link: importDoc('42888239_850ac5cb63b22dda0876b26699c78a3d.pdf'),
			},
		],
	},
];
export const news: IDocumentsList[] = [
	{
		title:
			'Баланс (Звіт про фінансовий стан) на 31 грудня 2023',
		link: importDoc('42888239_61d01af021438b7f3cd0a55c47f2a0d2.pdf'),
	},
	{
		title:
			'Примітки до фінансової звітності за період, що закінчився 31 грудня' +
			' 2023 року',
		link: importDoc('42888239_b3b4f5cb168b1a8d2a68b210d1146438.pdf'),
	},
	{
		title:
			'Звіт про власний капітал за Рік 2023',
		link: importDoc('42888239_ca2f3937306b296c26f0cd74e897d61e.pdf'),
	},
	{
		title:
			'Звіт про рух грошових коштів (за прямим методом) за Рік 2023',
		link: importDoc('42888239_4c8649f6ae4b52c3c1a816f50f3d40e4.pdf'),
	},
	{
		title:
			'Звіт про фінансові результати (Звіт про сукупний дохід) за Рік 2023',
		link: importDoc('42888239_ab69dcbc9d70f99d7d8094e74e2f34a5.pdf'),
	},
	{
		title:
			'Баланс (Звіт про фінансовий стан) на 31 березня 2023',
		link: importDoc('42888239_34cc2a54eea03fe417b2b3cbc7e384e0.pdf'),
	},
	{
		title:
			'Звіт про фінансові результати (Звіт про сукупний дохід) за I Квартал 2023',
		link: importDoc('42888239_83e48a009245f86a6d61892616e86c26.pdf'),
	},
	{
		title:
			'Звіт про рух грошових коштів (за прямим методом) за I Квартал 2023',
		link: importDoc('42888239_83e48a009245f86a6d61892616e86c26 (1).pdf'),
	},
	{
		title:
			'Звіт про власний капітал за I Квартал 2023',
		link: importDoc('42888239_9713ded1cd6e610073f5c260b0c7910c.pdf'),
	},
	{
		title:
			'Примітки до фінансової звітності за період, що закінчився 31 березня 2023 року',
		link: importDoc('42888239_b377c49785da49ac0dace701d1cf40c8.doc'),
	},
	{
		title:
			'Баланс (Звіт про фінансовий стан) на 30 червня 2023',
		link: importDoc('42888239_889574461b0beb02a07494410535b2a7.pdf'),
	},
	{
		title:
			'Звіт про фінансові результати (Звіт про сукупний дохід) за I Півріччя 2023',
		link: importDoc('42888239_2322cdef6bf017d85c57e46587d558d8.pdf'),
	},
	{
		title:
			'Звіт про рух грошових коштів (за прямим методом) за I Півріччя 2023',
		link: importDoc('42888239_80f49d33c819967c0574df9eb189647d.pdf'),
	},
	{
		title:
			'Звіт про власний капітал за I Півріччя 2023',
		link: importDoc('42888239_9051aeb9f3e70a5f7171654a8823d421.pdf'),
	},
	{
		title:
			'Примітки до фінансової звітності за період, що закінчився 30 червня 2023 року',
		link: importDoc('42888239_0eee933e5d4173312a2b5e017c440318.doc'),
	},
	{
		title:
			'Баланс (Звіт про фінансовий стан) на 30 вересня 2023',
		link: importDoc('42888239_881248ff233de79e211c6a2a4ecdca8b.pdf'),
	},
	{
		title:
			'Звіт про фінансові результати (Звіт про сукупний дохід) за 9 Мiсяцiв 2023',
		link: importDoc('42888239_5f469fbefe292717031cb8be53a3aa7a.pdf'),
	},
	{
		title:
			'Звіт про рух грошових коштів (за прямим методом) за 9 Мiсяцiв 2023',
		link: importDoc('42888239_6f6aa7e595b8b51bdfe44c6fc2a99687.pdf'),
	},
	{
		title:
			'Звіт про власний капітал за 9 Мiсяцiв 2023',
		link: importDoc('42888239_04f12597c1158e20c37f0bd86d137379.pdf'),
	},
	{
		title:
			'Примітки до фінансової звітності за період, що закінчився 30 вересня 2023',
		link: importDoc('42888239_5f95bb5064b8135db79f0e54123932d5.doc'),
	},
	{
		title:
			"Оголошення про проведення конкурсу з відбору суб'єкта" +
			" аудиторської діяльності ТОВ «ФК «ФІН-РАНГ» від 31.01.2023 р. ",
		link: importDoc(
			'1. Ogoloshennya pro provedennya konkursu z vidboru subyekta auditorskoyi diyalnosty FIN_RANG.pdf',
		),
	}
];
export const infoOwnershipStructure: IDocumentsListGroup[] = [
	{
		groupTitle: '2024',
		list: [
			{
				title:
					'Схематичне зображення структури власності ТОВ «ФК «ФІН-РАНГ» станом на 01.01.2024',
				link: importDoc('1_Struktura_vlasnosti_TOV_FK_FIN_RANH_010124.pdf'),
			}, {
				title:
					'Відомості про остаточних ключових учасників у структурі власності надавача фінансових\n' +
					'послуг ТОВ «ФК «ФІН-РАНГ» станом на 01.01.2024',
				link: importDoc('2_Vidomosti_pro_ostatochnykh_kliuchovykh_uchasnykiv_TOV_FK_FIN_RANH_010124.pdf'),
			}, {
				title:
					'Відомості про власників істотної участі в надавачі фінансових послуг ТОВ «ФК «ФІН-РАНГ»\n' +
					'станом на 01.01.2024',
				link: importDoc('3_Vidomosti_pro_vlasnykiv_istotnoi_uchasti_TOV_FK_FIN_RANH_010124.pdf'),
			}
		],
	},
	{
		groupTitle: '2023',
		list: [
			{
				title:
					'Схематичне зображення структури власності ТОВ «ФК «ФІН-РАНГ» станом на 01.01.2023',
				link: importDoc('1_Struktura vlasnosti TOV FK FIN-RANH na 01.01.2023.pdf'),
			}, {
				title:
					'Відомості про остаточних ключових учасників у структурі власності надавача фінансових\n' +
					'послуг ТОВ «ФК «ФІН-РАНГ» станом на 01.01.2023',
				link: importDoc('2_Vidomosti_pro_ostatochnykh_kliuchovykh_uchasnykiv_TOV_FK_FIN_RANH (1).pdf'),
			}, {
				title:
					'Відомості про власників істотної участі в надавачі фінансових послуг ТОВ «ФК «ФІН-РАНГ»\n' +
					'станом на 01.01.2023',
				link: importDoc('3_Vidomosti_pro_vlasnykiv_istotnoi_uchasti_TOV_FK_FIN_RANH_na_01.pdf'),
			},
		],
	}, {
		groupTitle: '2022',
		list: [
			{
				title:
					'Схематичне зображення структури власності ТОВ «ФК «ФІН-РАНГ» станом на 28.10.2022',
				link: importDoc('1_Struktura vlasnosti TOV FK FIN-RANH na 28.10.2022.pdf'),
			}, {
				title:
					'Відомості про остаточних ключових учасників у структурі власності надавача фінансових\n' +
					'послуг ТОВ «ФК «ФІН-РАНГ» станом на 28.10.2022',
				link: importDoc('2_Vidomosti_pro_ostatochnykh_kliuchovykh_uchasnykiv_TOV_FK_FIN_RANH.pdf'),
			}, {
				title:
					'Відомості про власників істотної участі в надавачі фінансових послуг ТОВ «ФК «ФІН-РАНГ»\n' +
					'станом на 28.10.2022',
				link: importDoc('3_Vidomosti_pro_vlasnykiv_istotnoi_uchasti_TOV_FK_FIN_RANH_na_28.pdf'),
			},
		],
	},
];
