import type {IDocumentsList, IDocumentsListGroup} from "@utils/types";
import {importDoc} from "@utils/formatters";

export const regularInformation = [];
export const otherInformation = [];

export const reports: IDocumentsListGroup[] = [
	{
		groupTitle: '2024', list: [
			{
				title: 'Схематичне зображення структури власності ТОВ «ФК «ФІН-РАНГ» станом на 01.01.2024',
				link: importDoc('42888239_e8479160b60d8a40ee7eb01530b33ad6.pdf')
			}, {
				title: 'Відомості про остаточних ключових учасників у структурі власності надавача фінансових послуг ТОВ «ФК «ФІН-РАНГ» станом на 01.01.2024',
				link: importDoc('42888239_210cf87f4cce8092bfffe554f0d67388.pdf')
			}, {
				title: 'Відомості про власників істотної участі в надавачі фінансових послуг ТОВ «ФК «ФІН-РАНГ» станом на 01.01.2024',
				link: importDoc('42888239_6e16fa7cef79b443f1aee41dccdfd86b.pdf')
			},
		]
	},
	{
		groupTitle: '2023', list: [
			{
				title: 'Схематичне зображення структури власності ТОВ «ФК «ФІН-РАНГ» станом на 01.01.2023',
				link: importDoc('42888239_5b391a962842072cf30474c92f92a1da.pdf')
			}, {
				title: 'Відомості про остаточних ключових учасників у структурі власності надавача фінансових послуг ТОВ «ФК «ФІН-РАНГ» станом на 01.01.2023',
				link: importDoc('42888239_e4045d06f136f28de2e68357437565d5.pdf')
			}, {
				title: 'Відомості про власників істотної участі в надавачі фінансових послуг ТОВ «ФК «ФІН-РАНГ» станом на 01.01.2023',
				link: importDoc('42888239_93e55c9d2a615422b161e948ad67a77f.pdf')
			},
		]
	},
	{
		groupTitle: '2022', list: [
			{
				title: 'Схематичне зображення структури власності ТОВ «ФК «ФІН-РАНГ» станом на 28.10.2022',
				link: importDoc('42888239_99dea925b397858456f211abcbd82927.pdf')
			}, {
				title: 'Відомості про остаточних ключових учасників у структурі власності надавача фінансових послуг ТОВ «ФК «ФІН-РАНГ» станом на 28.10.2022',
				link: importDoc('42888239_98b6f033c4c72ce639b7448cd7483558.pdf')
			}, {
				title: 'Відомості про власників істотної участі в надавачі фінансових послуг ТОВ «ФК «ФІН-РАНГ» станом на 28.10.2022',
				link: importDoc('42888239_3f0900718ce45a0a788977be572f31e7.pdf')
			}, {
				title: 'Механізми захисту прав споживачів',
				link: importDoc('42888239_0089cfb528770306a56d5e15cab52f41.pdf')
			}, {
				title: 'Порядок розгляду ТОВ «ФК ФІН-РАНГ» звернень споживачів фінансових послуг',
				link: importDoc('42888239_9f5aaf69f9f83668ae0c738b56a50145.pdf')
			}, {
				title: 'Інформація про органи захисту прав споживачів',
				link: importDoc('42888239_feee928ffa35bcfc69df20d72cf59cdf.pdf')
			}, {
				title: 'Інформація щодо ТОВ «ФК ФІН-РАНГ», умов та порядку діяльності, включно щодо фінансових послуг, які надаються ТОВ «ФК ФІН-РАНГ» клієнту',
				link: importDoc('42888239_feee928ffa35bcfc69df20d72cf59cdf (1).pdf')
			}, {
				title: 'Публічна інформація про ТОВ «ФК ФІН-РАНГ»',
				link: importDoc('42888239_7b7a580b975fa78cb9f7d191c206de2b.pdf')
			}, {
				title: 'Свідоцтво ТОВ «ФК ФІН-РАНГ»',
				link: importDoc('42888239_b0f790d9663cd6ad125d95f47496bb95.pdf')
			}, {
				title: 'Ліцензії на надання фінансових послуг',
				link: importDoc('42888239_d986c2a91ee79ec3d7ba130a6c02f55e.pdf')
			}, {
				title: 'Інформація для маломобільних груп населення',
				link: importDoc('42888239_2c19eed88ac38b142eb49dd19cb7ae4e.pdf')
			}, {
				title: 'Ціни та тарифи на надання фін.послуг ТОВ «ФК «ФІН-РАНГ»',
				link: importDoc('42888239_83542a256080343c9f4c5fef16ba0829.pdf')
			}, {
				title: 'Відомості про колекторські компанії',
				link: importDoc('42888239_60f05bb2b95430fc5502a3cce7aeaad7.pdf')
			}, {
				title: 'Вимоги до етичної поведінки в ТОВ «ФК «ФІН-РАНГ»',
				link: importDoc('42888239_ced30fa6e00cb550eac6f694c01559cc.pdf')
			}, {
				title: 'Перелік контактних даних щодо діяльності залученої колекторської компанії',
				link: importDoc('42888239_1713a277ee5d0127c1ea4b4ad6d16199.pdf')
			}, {
				title: 'Порядок і спосіб погашення простроченої заборгованості в ТОВ «ФК «ФІН-РАНГ»',
				link: importDoc('42888239_f55545ba17f39b61d7fb9f8a20c9249e.pdf')
			}, {
				title: 'Порядок обробки і захисту персональних даних у ТОВ «ФК «ФІН-РАНГ»',
				link: importDoc('42888239_850ac5cb63b22dda0876b26699c78a3d.pdf')
			},
		]
	}
];
export const news: IDocumentsList[] = [
	{
		title: '',
		link: importDoc('')
	}
];
